/*----------------------------------------------------------------------------------------------------------
--  상기 프로그램에 대한 저작권을 포함한 지적재산권은 (주)미라콤아이앤씨에 있으며, (주)미라콤아이앤씨가
--  명시적으로 허용하지 않은 사용, 복사, 변경, 제3자에의 공개, 배포는 엄격히 금지되며, (주)미라콤아이앤씨의
--  지적재산권 침해에 해당됩니다.
--  (Copyright ⓒ 2011 Miracom Inc. All Rights Reserved | Confidential)
--
--  Program Id      : c_FArrowEnds.cs
--  Creator         : byjeon
--  Create Date     : 2012.09.27
--  Description     : FAMate Core FaUIs WPF Arrow Ends Symbol Class
--  History         : Created by byjeon at 2012.09.27
----------------------------------------------------------------------------------------------------------*/
using System;

namespace Nexplant.MC.Core.FaUIs.WPF
{

    //------------------------------------------------------------------------------------------------------------------------

    [Flags]
    public enum FArrowEnds
    {
        None = 0,
        Start = 1,
        End = 2,
        Both = 3
    }

    //------------------------------------------------------------------------------------------------------------------------

} // Namespace end