/*----------------------------------------------------------------------------------------------------------
--  상기 프로그램에 대한 저작권을 포함한 지적재산권은 (주)미라콤아이앤씨에 있으며, (주)미라콤아이앤씨가
--  명시적으로 허용하지 않은 사용, 복사, 변경, 제3자에의 공개, 배포는 엄격히 금지되며, (주)미라콤아이앤씨의
--  지적재산권 침해에 해당됩니다.
--  (Copyright ⓒ 2011 Miracom Inc. All Rights Reserved | Confidential)
--
--  Program Id      : i_FITransactExecutor.cs
--  Creator         : kitae
--  Create Date     : 2011.02.28
--  Description     : FAMate Core FaCommon Database FITransactExecutor Interface
--  History         : Created by kitae at 2011.02.28
----------------------------------------------------------------------------------------------------------*/
using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace Nexplant.MC.Core.FaCommon
{
    public interface FITransactExecutor
    {
        //------------------------------------------------------------------------------------------------------------------------

        #region Properties

        int sqlCount
        {
            get;
        }

        //------------------------------------------------------------------------------------------------------------------------

        FSqlCollection sqlCollection
        {
            get;
        }

        #endregion

        //------------------------------------------------------------------------------------------------------------------------

        #region Methods
        
        void appendSql(
            FSql sql
            );       

        //------------------------------------------------------------------------------------------------------------------------

        int execute(
            int timeout,
            bool sqlClear
            );

        //------------------------------------------------------------------------------------------------------------------------

        int execute(
            int tiemout
            );

        //------------------------------------------------------------------------------------------------------------------------

        int execute(
            bool sqlClear
            );

        //------------------------------------------------------------------------------------------------------------------------

        int execute(
            );

        #endregion

        //------------------------------------------------------------------------------------------------------------------------

    } // Interface end
} // Namespace end
